src/InformationRegisters/ДвижениеКонтингента/ДвижениеКонтингента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="47e8464e-9763-4317-a4ae-4ca6ebcc7602">
  <name>ДвижениеКонтингента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="9ea5ce08-4d4b-499b-9408-67a197d2f908">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5eeb9c73-65da-4613-8765-72f500d0a5bc">
    <name>Группа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d6b3e324-572e-4f49-af6c-e16c52bc0d94">
    <name>Студент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСтудентов/СтатусыСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aef7c28e-427a-463a-9c48-4807074b5733">
  <name>СтатусыСтудентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8cd651b3-76b4-445a-a64d-03bf4f66d5f7">
    <name>Студент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/stdl_Студенты/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс
// Получить студента.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - СправочникСсылка.Студенты
//  - Неопределено
Функция Получить(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеКонтингентаСрезПоследних.Студент КАК Студент
	|ИЗ
	|	РегистрСведений.ДвижениеКонтингента.СрезПоследних КАК ДвижениеКонтингентаСрезПоследних
	|ГДЕ
	|	ДвижениеКонтингентаСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСтудентов.Студент)
	|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДвижениеКонтингентаСрезПоследних.Студент) = &УИД";

	Запрос.УстановитьПараметр("УИД", УИД);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Студент;
КонецФункции

// Получить студента по физическому лицу.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  - СправочникСсылка.Студенты
//  - Неопределено
Функция ПолучитьПоФизическомуЛицу(ФизическоеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеКонтингентаСрезПоследних.Студент КАК Студент
	|ИЗ
	|	РегистрСведений.ДвижениеКонтингента.СрезПоследних КАК ДвижениеКонтингентаСрезПоследних
	|ГДЕ
	|	ДвижениеКонтингентаСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСтудентов.Студент)
	|	И ДвижениеКонтингентаСрезПоследних.Студент.Ссылка.ФизЛицо = &ФизическоеЛицо";

	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Студент;
КонецФункции
#КонецОбласти
